# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [75]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [76]:
numbers1 = np.random.randint(low=1, high=5, size=100)
numbers2 = np.random.randint(low=1, high=4, size=100)
numbers3 = np.random.randint(low=10000, high=30001, size=100)

### Step 3. Let's create a DataFrame by joinning the Series by column

In [77]:
df1 = pd.DataFrame(numbers1)
df2 = pd.DataFrame(numbers2)
df3 = pd.DataFrame(numbers3)

df = pd.concat([df1,df2,df3],axis=1)
df

    0  0      0
0   3  1  24004
1   4  3  11791
2   1  3  17216
3   3  1  13755
4   3  1  23936
.. .. ..    ...
95  3  2  10022
96  2  1  24517
97  2  3  19347
98  4  3  26334
99  3  3  12675

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [78]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       3       1            24004
1       4       3            11791
2       1       3            17216
3       3       1            13755
4       3       1            23936
..    ...     ...              ...
95      3       2            10022
96      2       1            24517
97      2       3            19347
98      4       3            26334
99      3       3            12675

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [79]:
df_new = df.bedrs.astype(str).str.cat(df.bathrs.astype(str)).str.cat(df.price_sqr_meter.astype(str))
df_new.columns = ['bigcolumn']

df_new

0     3124004
1     4311791
2     1317216
3     3113755
4     3123936
       ...
95    3210022
96    2124517
97    2319347
98    4326334
99    3312675
Name: bedrs, Length: 100, dtype: object

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [83]:
df_new = df_new.reset_index(drop=True)
print(df_new)

0     3124004
1     4311791
2     1317216
3     3113755
4     3123936
       ...
95    3210022
96    2124517
97    2319347
98    4326334
99    3312675
Name: bedrs, Length: 100, dtype: object

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [84]:
df_new.reset_index()
df_new.reindex(index=range(0,299))

0      3124004
1      4311791
2      1317216
3      3113755
4      3123936
        ...
294        NaN
295        NaN
296        NaN
297        NaN
298        NaN
Name: bedrs, Length: 299, dtype: object